{
    "automation": [
        {
            "name": "Iron Chains",
            "image": "iron-chains.jpg",
            "versions": "1.14+",
            "desc": [
                "Iron Chains can be crafted with Iron Ingots and Nuggets.",
                "When right clicked onto a boat or minecart, and then onto another, they'll link the two. Linked boats and minecarts will always remain at close distance, which allows you to make trains.",
                "Additionally, Iron Chains can be used to craft chainmail armor."
            ]
        },
        {
            "name": "Chute",
            "image": "chute.jpg",
            "versions": "1.14+",
            "desc": [
                "The Chute is a new automation block. Items can be inserted into it via automation (Hopper, Dropper, etc), and any items inserted are instantly dropped under it, always precisely in the center.",
                "The Chute can be disabled with a redstone signal or by placing a block under it."
            ]
        },
        {
            "name": "Color Slime",
            "image": "color-slime.jpg",
            "versions": "1.14+",
            "desc": [
                "Slime blocks can be dyed Red and Blue. The primary color blocks (Red, Green, and Blue) can be combined to create secondary colors (Cyan, Magenta, and Yellow).",
                "While being moved by pistons, two slime blocks will only connect if they're the same color, or if one is made of another (so Red won't connect to Blue, but it'll connect to Magenta). Any color of slime will connect to non-slime blocks around it normally."
            ]
        },
        {
            "name": "Dispensers Place Blocks",
            "image": "dispensers-place-blocks.jpg",
            "versions": "1.14+",
            "desc": [
                "Dispensers are allowed to place blocks in the world. Any blocks that already had a placement behaviour, like TNT, are ignored.",
                "The blocks are rotated so they're placed forward from the dispenser. Note that crops such as Wheat Seeds or Potatoes also count."
            ]
        },
        {
            "name": "Ender Watcher",
            "image": "ender-watcher.jpg",
            "versions": "1.14+",
            "desc": [
                "The Ender Watcher is a new redstone input block. It emits a full redstone signal if a player is looking directly at it.",
                "It's crafted with an Eye of Ender, Redstone and Blocks of Biotite (from the World category, or Obsidian if not enabled)."
            ]
        },
        {
            "name": "Feeding Trough",
            "image": "feeding-trough.jpg",
            "versions": "1.14+",
            "desc": [
                "The Feeding Trough is a new block you can craft with some planks and fence gates. When right clicked, a menu will pop up where you can put food inside it.",
                "Nearby animals will flock to the trough to eat the food within. This works just as if a player had fed the animal, but with a few differences:",
                "*There's a chance the animal will need more than one bit of food to get in love mode;",
                "*Animals bred with the trough will not produce XP;",
                "*If there's more than 32 animals in a 10 block radius, the animals will eat, but never enter love mode."
            ]
        },
        {
            "name": "Gravisand",
            "image": "gravisand.jpg",
            "versions": "1.14+",
            "desc": [
                "Gravisand is a new sand variant, crafted with sand and an ender pearl.",
                "Gravisand will not fall unless primed with redstone. However, if gravisand receives a signal, and can not fall, it'll instead float up. Additionally, gravisand will propagate the signal to any adjacent gravisand blocks, causing them to fall or float as well.",
                "Gravisand allows for a variety of redstone components, especially as its magnetic properties have it constantly output a comparator signal of 15."
            ]
        },
        {
            "name": "Iron Rod",
            "image": "iron-rod.jpg",
            "versions": "1.14+",
            "desc": [
                "Pistons pushing an Iron Rod will have it work as a drill of sorts, breaking any blocks in front in the direction the rod is facing. These can break anything the piston can push.",
                "Iron Rods are crafted with 2 Iron Ingots and an End Rod."
            ]
        },
        {
            "name": "Pistons Move Tile Entities",
            "image": "pistons-move-tes.jpg",
            "versions": "1.14+",
            "desc": [
                "Pistons are allowed to move Tile Entities (blocks with extra data attached, like Chests or Furnaces). Attempting to move a block to an invalid position will cause it to break and drop its contents (e.g. trying to create a triple chest).",
                "For a block that pistons can't move, now that furnaces can't be used, look into Sturdy Stone in the Building category.",
                "Note that some blocks such as Monster Spawners can't be moved this way, so you don't go and break the game!"
            ]
        },
        {
            "name": "New Redstone Circuits",
            "image": "new-redstone-circuits.jpg",
            "versions": "1.14+",
            "desc": [
                "Two new redstone circuit components are added to the game, the Redstone Randomizer, and the Redstone Inductor:",
                "*The Randomizer is crafted the same was as a comparator, but with Biotite (from the World category, or an Eye of Ender if disabled). When given a redstone signal from the back, it'll randomly enable either the left or right output.",
                "*The Inductor is crafted made with Stone, Redstone, and Magma Cream. Its output value is the analog sum of all 3 input sides. It can also be locked by having a repeater or comparator pointing to it. While locked, it'll maintain the output value regardless of any changes."
            ]
        },
        {
            "name": "Weather Sensor",
            "image": "weather-sensor.jpg",
            "versions": "1.14+",
            "desc": [
                "The Weather Sensor is crafted with Purpur Slabs, Biotite (from the World category, or Obsidian if not enabled) and Glass. It works like a Daylight Sensor, but it emits a full redstone signal if it's raining or snowing.",
                "Right clicking it inverts its output."
            ]
        },       
        {
            "name": "Obsidian Pressure Plate",
            "image": "obsidian-pressure-plate.jpg",
            "versions": "1.14+",
            "desc": [
                "Pressure Plates made with obsidian will only trigger when Players walk over them."
            ]
        },
        {
            "name": "Metal Buttons",
            "image": "metal-buttons.jpg",
            "versions": "1.14+",
            "desc": [
                "Combining a Wooden Button with either an Iron Ingot or a Gold Ingot creates a button of that type.",
                "Drawing influence from Weighted Pressure Plates, Gold Buttons emit a very short pulse (2 redstone ticks), whereas Iron Buttons emit a very long pulse (5 seconds)."
            ]
        }
    ],
    "building": [
        {
            "name": "Compressed Blocks",
            "image": "compressed-blocks.jpg",
            "versions": "1.14+",
            "desc": [
                "A bunch of blocks can now be crafted into compressed variants.",
                "*Charcoal can be crafted into a Charcoal Block, which will burn forever.",
                "*Blaze Rods and Powder can be crafted into a Blaze Lantern. It'll also burn forever.",
                "*Sugar Cane, Bamboo, Cactus, Chorus Fruits, and Sticks can be made into various blocks that can be placed like a pillar.",
                "*Apples, Golden Apples, Potatoes, Carrots, and Beetroots can be crafted into Crates. Golden Apple crates will work as a beacon base.",
                "*Cocoa Beans, Nether Wart, and Gunpowder can be crafted into Sacks. If the Nether Wart Sack is enabled, the recipe for Nether Wart Blocks is changed to be 2x2."
            ]
        },
        {
            "name": "Duskbound Blocks",
            "image": "duskbound-blocks.jpg",
            "versions": "1.14+",
            "desc": [
                "Purple looking blocks made from Purpur and Obsidian, fully featured with stair, slab and wall variants.",
                "Also includes Duskbound Lamps, made with Duskbound Blocks and Ender Pearls."
			]
        },
        {
            "name": "Framed Glass",
            "image": "framed-glass.jpg",
            "versions": "1.14+",
            "desc": [
                "Combine Iron Ingots and Glass, and you get yourself some fancy Framed Glass, great for some more rustic or medieval builds.",
                "You can also craft Panes with these, of course."
            ]
        },
        {
            "name": "Iron Grate",
            "image": "grate.jpg",
            "versions": "1.14+",
            "desc": [
                "The Iron Grate is a cool new block with multiple uses. Animals are afraid of walking on it, and will never do it, whereas items will just fall through the gaps.",
                "Players, monsters, and other entities will just walk through normally."
            ]
        },
        {
            "name": "Item Frame Variants",
            "image": "item-frame-variants.jpg",
            "versions": "1.14+",
            "desc": [
                "Item Frames can now be displayed in two new fancy ways:",
                "*First off, you can dye them any of the 16 colors of the minecraft rainbow.",
                "*Secondly, you can craft a Glass Item Frame. Glass Item Frames will hide the frame around the item when you put it in, so you can have a display that only shows the item.",
                "*Lastly, you can use Item Frames as wallpaper. If you put a banner inside a Glass Item Frame, it'll sit flat with the wall with the pattern that's in it."
            ]
        },
        {
            "name": "Leaf Carpet",
            "image": "leaf-carpet.jpg",
            "versions": "1.14+",
            "desc": [
                "Leaf Carpet can be made with all types of leaves in the same recipe as wool carpet. It can be harvested by hand and has no collision box."
            ]
        },
        {
            "name": "Lit Lamp",
            "image": "lit-lamp.jpg",
            "versions": "1.14+",
            "desc": [
                "Combining a Redstone Lamp with a Redstone Torch creates a Lit Redstone lamp, that's always emitting light."
            ]
        },
        {
            "name": "Midori",
            "image": "midori.jpg",
            "versions": "1.14+",
            "desc": [
                "Midori Blocks are a green counterpart to Purpur. These are made with Cactus Paste, with the same recipes as the Purpur blocks.",
                "Cactus Paste is a new item that replaces Green Dye as the smelting output from Cactus. It can be crafted into Green Dye at a 1:1 rate.",
                "(Midori means \"green\" in Japanese)"
            ]
        },
        {
            "name": "More Brick Types",
            "image": "more-brick-types.jpg",
            "versions": "1.14+",
            "desc": [
                "New brick variants are added for a few blocks:",
                "*Sandy Bricks can be crafted with Bricks and Sand.",
                "*Snowy Bricks can be crafted with Snow.",
                "*Magma Bricks can be crafted with Magma Blocks. These glow in the dark just like Magma.",
                "*Charred Nether Bricks can be crafted with Nether Bricks and a Fire Charge.",
                "*Sandstone Bricks (for all sandstone types) can be crafted with Cut Sandstone.",
                "Additionally, all of these come in Slab, Stairs, and Wall variants."
            ]
        },
        {
            "name": "More Stone Variants",
            "image": "more-stone-variants.jpg",
            "versions": "1.14+",
            "desc": [
                "Brick, Chiseled Brick, Pillar, and Pavement variants are available for all types of stone added by vanilla and Quark.",
                "The Brick types come in Slab, Stair, and Wall variants, and the Chiseled Brick types look different for each type of stone."
            ]
        },
        {
            "name": "Nether Brick Fence Gate",
            "image": "nether-brick-fence-gate.jpg",
            "versions": "1.14+",
            "desc": [
                "A Fence Gate made of Nether Bricks. Crafted with Nether Brick blocks in the place of planks and Nether Brick Fences in the place of Sticks. The recipe outputs 2."
            ]
        },
        {
            "name": "Paper Decor",
            "image": "paper-decor.jpg",
            "versions": "1.14+",
            "desc": [
                "Oriental style decoration can now be made with Paper and Bamboo.",
                "*Paper Walls (\"Shoji\") come in three variants: Normal, Big, and Decorated. The latter can be crafted by adding a Sapling.",
                "*Paper Lanterns (\"Chochin\") come in Normal and Decorated variants, the latter similarly crafted with a Sapling. Try hanging or propping them with fences!"
            ]
        },
        {
            "name": "Quilted Wool",
            "image": "quilted-wool.jpg",
            "versions": "1.14+",
            "desc": [
                "Crafting Wool with String creates Quilted Wool. Quilted Wool comes in all colors and has a framed design."
            ]
        },
        {
            "name": "Rope",
            "image": "rope.jpg",
            "versions": "1.14+",
            "desc": [
                "Rope Coils can be crafted using String. This new block can be placed on the bottom face of a block, by players and dispensers, and dropped down by right clicking on the placed Rope block. Shift-right clicking, or right clicking with a non-rope item will pull the rope up.",
                "If a block is at the end of the rope, it'll drop down and be pulled up alongside it. Lastly, as you'd expect, players can climb rope as if it were a ladder."
            ]
        },
        {
            "name": "Shingles",
            "image": "shingles.jpg",
            "versions": "1.14+",
            "desc": [
                "Shingles are \"Tile\" style blocks for Terracotta and all its color variants inspired by Portuguese rooftops (\"Telha Lusa\"). They can all be turned into stairs and slabs, and look great for roofs.",
                "4 Blocks are crafted with a 2x2 of the respective Terracotta block."
            ]
        },
        {
            "name": "Soul Sandstone",
            "image": "soul-sandstone.jpg",
            "versions": "1.14+",
            "desc": [
                "Sandstone made of Soul Sand. All recipes are as expected.",
                "Soul Sandstone can be turned into Stairs, Slabs, and Walls."
            ]
        },
        {
            "name": "Stained Planks",
            "image": "stained-planks.jpg",
            "versions": "1.14+",
            "desc": [
                "Dyed Wooden Planks of all 16 colors, featuring a pastel color palette so you can actually build with them without making your eyes hurt! All include stair and slab variants."
            ]
        },
        {
            "name": "Sturdy Stone",
            "image": "sturdy-stone.jpg",
            "versions": "1.14+",
            "desc": [
                "A hard stone block made with 4 Stone and 4 Cobblestone (outputs 4). The block has the Furnace Texture, and can not be moved by Pistons."
            ]
        },
        {
            "name": "Tallow And Candles",
            "image": "tallow-and-candles.jpg",
            "versions": "1.14+",
            "desc": [
                "In an attempt to make pigs be useful in any way, they drop Tallow. Tallow can be crafted alongside String to create Candles, or as a furnace fuel.",
                "Candles come in all 16 colors of the spectrum, and emit as much light as torches. Candles will also fall like sand if there's no block under them, which can have many fun uses.",
                "Lastly, for Enchanting Table purposes, two candles equal one bookshelf."
            ]
        },
        {
            "name": "Thatch",
            "image": "thatch.jpg",
            "versions": "1.14+",
            "desc": [
                "Thatch is created via a 2x2 of Wheat. It can be used for stairs and slabs or turned back into 4 Wheat. You can use it for some fancy medieval roof styles."
            ]
        },
        {
            "name": "Turf",
            "image": "turf.jpg",
            "versions": "1.14+",
            "desc": [
                "Turf Blocks can be crafted using a few bits of Tall Grass.",
                "These blocks have the grass texture and coloring on all sides, are available in stair and slab variants, and do not decay when a block is on top."
            ]
        },
        {
            "name": "Variant Bookshelves",
            "image": "variant-bookshelves.jpg",
            "versions": "1.14+",
            "desc": [
                "You can now make Bookshelves out of all wood types. All of these bookshelves work for the Enchanting Table too."
            ]
        },
        {
            "name": "Variant Chests",
            "image": "variant-chests.jpg",
            "versions": "1.14+",
            "desc": [
                "Chests can be made of all the different wood types. Each one is styled differently for the type of wood you use."
            ]
        },
        {
            "name": "Variant Ladders",
            "image": "variant-ladders.jpg",
            "versions": "1.14+",
            "desc": [
                "Ladders can be made of all the different wood types. To compensate for the fact that sticks do not come in different wood types, the recipe for ladders is changed to have a single plank of the corresponding wood type in the center.",
                "You can also make Iron Ladders, using Iron Ingots. They work like normal ladders, except that they can stand by themselves as long as there is an Iron Ladder on top, even if there isn't a block behind."
            ]
        },
        {
            "name": "Vertical Planks",
            "image": "vertical-planks.jpg",
            "versions": "1.14+",
            "desc": [
                "Putting 3 wooden planks in a vertical line creates 3 Vertical Wooden Planks. Doing the same reverts it.",
                "If Stained Wooden Planks is enabled, vertical versions of those are also added."
            ]
        },
        {
            "name": "Vertical Slabs",
            "image": "vertical-slabs.jpg",
            "versions": "1.14+",
            "desc": [
                "Do I have to explain this?",
                "They exist for every vanilla and Quark block that has a slab, and can be crafted by placing 3 of the respective slab in a column."
            ]
        }
    ],
    "client": [
        {
            "name": "Chest Searching",
            "image": "chest-searching.jpg",
            "versions": "1.14+",
            "desc": [
                "A filter button will now appear on the top right of chests you open. When you click it, a tab with a search bar will pop up, where you can type and filter items in the chest by your query. Items that don't match will be darkened.",
                "You can also search for enchantment and potion names, or wrap the search in quotes to match entire names."
            ]
        },
        {
            "name": "Greener Grass",
            "image": "greener-grass.jpg",
            "versions": "1.14+",
            "desc": [
                "Grass is greener on the Quark side. Biome colors are still respected, but are greener non the less.",
                "There's also config options to enable Alpha style grass, which gives you the Minecraft Alpha vibe, or to manually set the grass color."
            ]
        },
        {
            "name": "Improved Mount HUD",
            "image": "improved-mount-hud.jpg",
            "versions": "1.14+",
            "desc": [
                "While on a mount, your food display is still shown. Furthermore, while on a horse, the jump bar is only shown while holding down the jump key, the XP bar is shown otherwise."
            ]
        },
        {
            "name": "Improved Tooltips",
            "image": "improved-tooltips.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Usage Ticker",
            "image": "usage-ticker.jpg",
            "versions": "1.14+",
            "desc": [
                "A small interface addition shows up next to the hotbar when items are used, or armor takes damage. This shows how many items or blocks you have left, or how the status of your armor is.",
                "As this feature is hard to demonstrate in a static picture, click the picture icon in the bottom of this card to see a demo gif."
            ]
        },
        {
            "name": "Vanilla Resource Changes",
            "image": "vanilla-resource-changes.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Variant Animal Textures",
            "image": "variant-animal-textures.jpg",
            "versions": "1.14+",
            "desc": [
                "Cows, Pigs, and Chicken will now have randomized textures from a small pool of variants. Additionally, some animals may rarely show up with a special variant..."
            ],
            "expand": [
            	"Here's a render with the new skins for your enjoyment:",
            	"!img/features/client/variant-animal-textures/render.png"
            ]
        }
    ],
    "management": [
        {
            "name": "Chests In Boats",
            "image": "chests-in-boats.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Easy Transfering",
            "image": "easy-transfering.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "F To Switch",
            "image": "f-to-switch.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Hotbar Changer",
            "image": "hotbar-changer.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Inventory Sorting",
            "image": "inventory-sorting.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Shulker Box Right Click",
            "image": "shulker-box-right-click.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        }
    ],
    "tools": [
        {
            "name": "Ancient Tomes",
            "image": "ancient-tomes.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Pathfinder Maps",
            "image": "pathfinder-maps.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Pickarang",
            "image": "pickarang.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Slime Bucket",
            "image": "slime-bucket.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Trowel",
            "image": "trowel.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        }
    ],
    "tweaks": [
        {
            "name": "Armed Armor Stands",
            "image": "armed-armor-stands.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Automatic Recipe Unlock",
            "image": "automatic-recipe-unlock.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Axe Leaf Harvesting",
            "image": "axe-leaf-harvesting.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Dirt To Path",
            "image": "dirt-to-path.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Double Door Opening",
            "image": "double-door-opening.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Dragon Scales",
            "image": "dragon-scales.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Enchanced Ladders",
            "image": "enchanced-ladders.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Glass Shards",
            "image": "glass-shards.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Hoe Harvesting",
            "image": "hoe-harvesting.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Improved Sleeping",
            "image": "improved-sleeping.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Lock Rotation",
            "image": "lock-rotation.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Note Block Mob Sounds",
            "image": "note-block-mob-sounds.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Pat The Dogs",
            "image": "pat-the-dogs.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Poison Potato Usage",
            "image": "poison-potato-usage.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Reacharound Placing",
            "image": "reacharound-placing.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Sign Editing",
            "image": "sign-editing.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Simple Harvest",
            "image": "simple-harvest.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Snow Golem Player Heads",
            "image": "snow-golem-player-heads.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Springy Slime",
            "image": "springy-slime.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Utility Recipes",
            "image": "utility-recipes.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Villagers Follow Emeralds",
            "image": "villagers-follow-emeralds.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        }
    ],
    "vanity": [
        {
            "name": "Colored Runes",
            "image": "colored-runes.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Emotes",
            "image": "emotes.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Item Sharing",
            "image": "item-sharing.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        }
    ],
    "world": [
        {
            "name": "Big Stone Clusters",
            "image": "big-stone-clusters.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Biotite",
            "image": "biotite.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Cave Roots",
            "image": "cave-roots.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Foxhounds",
            "image": "foxhounds.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "New Stone Types",
            "image": "new-stone-types.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Passive Creatures",
            "image": "passive-creatures.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Speleothems",
            "image": "speleothems.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Stonelings",
            "image": "stonelings.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Brimstone",
            "image": "underground-biome-brimstone.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Crystal Cave",
            "image": "underground-biome-crystal-cave.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Elder Prismarine",
            "image": "underground-biome-elder-prismarine.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Glowshroom",
            "image": "underground-biome-glowshroom.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Lush",
            "image": "underground-biome-lush.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Overgrown",
            "image": "underground-biome-overgrown.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Permafrost",
            "image": "underground-biome-permafrost.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Sandstone",
            "image": "underground-biome-sandstone.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Slime",
            "image": "underground-biome-slime.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Biome: Spider Nest",
            "image": "underground-biome-spider-nest.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        },
        {
            "name": "Underground Clay",
            "image": "underground-clay.jpg",
            "versions": "1.14+",
            "desc": [
                "todo"
            ]
        }
    ]
}